[
  {
    "scraped_at": "2025-07-01T10:29:56.951090",
    "date": "July 1, 2025",
    "title": "Daily Devotional with Pastor Jon",
    "scripture": "And all the people saw the thunderings, and the lightnings, and the noise of the trumpet, and the mountain smoking: and when the people saw it, they removed, and stood afar off. And they said unto Moses, Speak thou with us, and we will hear: but let not God speak with us, lest we die.",
    "scripture_reference": "Exodus 20:18–19",
    "content": "So powerful was God’s power and potency, His glory and grandeur that the people said, “You speak to us, Moses, because if God speaks to us, we’ll die.” And that’s the way it’s supposed to be. The Word of God is powerful, sharper than any two-edged sword. It pierces. It divides. It kills our pride, our self-centeredness, and our flesh (Hebrews 4:12). And because it does, the person who wants to pamper his flesh, the person caught up in the sins of the flesh will often be one who doesn’t want to hear from God anymore. If I choose to indulge my flesh day after day, week after week, I won’t be at Bible study six months down the road. If you’re at a place where lately it’s been hard to get into the Word, I have great news for you: God wants to do something special in you. Satan sees what God desires to do and is trying to keep you from that blessing. It’s a big one, a great one. So pick up the Word, let God speak, and discover the blessings in store.",
    "author": "Jon Courson"
  },
  {
    "scraped_at": "2025-06-30T10:29:58.825439",
    "date": "June 30, 2025",
    "title": "Daily Devotional with Pastor Jon",
    "scripture": "Thou shalt not covet thy neighbour’s house, thou shalt not covet thy neighbour’s wife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing that is thy neighbour’s.",
    "scripture_reference": "Exodus 20:17",
    "content": "Of all the commandments, the last one is probably taken the least seriously. If a person breaks the sixth commandment, he might be executed. If he breaks the eighth, he might end up in jail. If he breaks the ninth, he might be sued. But if he breaks the tenth commandment, not only is he forgiven, but applauded, for coveting is a key component of our culture. Essentially, to covet is simply to want more than one possesses. Our economy is based upon this. Society screams at us that the way to have real life is to have this car or that toy. But the Giver of Life, the Author of Life, the One who declared, “I am the Life,” said, “That’s not true. A man’s life does not consist of the stuff he has materially.” And to illustrate His point, He went on to give a parable of a man who had so many material goods that it was necessary for him to construct bigger barns to hold it all. Although the financial planners would consider him wise, and his culture might consider him blessed, God considered him a fool for failing to lay up treasure in the only place that matters: Heaven (Luke 12:20). If God blesses you materially, wonderful! God gives us richly all things to enjoy (1 Timothy 6:17). I find it interesting that in Jesus’ parable, the rich man was planning to enjoy his wealth in the future (Luke 12:19). In other words, up to that point, he never truly enjoyed what he had. And such is all too often the case. The man living for things, wanting more things, focused on things will never, ever be satisfied; he will always think he needs just a few more things to make him happy. The solution? Not only are we to enjoy material blessings, but we are to employ them, not to make more money for ourselves, but to help others, to extend the Gospel to others. Abraham, a wealthy man of Ur, left his comfortable life behind to seek a city whose builder and maker was God (Hebrews 11:10). He saw the big picture. He saw the Kingdom. And so must we.",
    "author": "Jon Courson"
  },
  {
    "scraped_at": "2025-06-30T01:18:32.099471",
    "date": "June 29, 2025",
    "title": "Daily Devotional with Pastor Jon",
    "scripture": "Thou shalt not bear false witness against thy neighbour.",
    "scripture_reference": "Exodus 20:16",
    "content": "The biblical viewpoint of bearing false witness is not confined to the telling of bold-faced lies, but also includes being tricky with the truth. In the one account where the phrase “false witness” is used in Scripture, we see individuals falsely accusing Jesus of threatening to destroy the Temple when, in fact, He was speaking of His own death (Matthew 26:59–61). Because he is the Father of Lies, Satan is the ultimate false witness, accusing us day and night before God’s throne as he points out our failings, our shortcomings, and our sins (Revelation 12:10). Jesus, on the other hand, is the Faithful and True Witness (Revelation 3:14), our Advocate, our defense lawyer. Are you a true witness or a false witness? If the person sitting next to you is a believer, he or she is righteously robed, Heaven-bound, Spirit-filled, positionally pure. Speaking anything less of them is bearing false witness. Oh, you might give the right information, but in so doing, do you convey the wrong implication? You might say lots of nice things about them, but do you add a “but, . . .” a “however, . . .” an “I don’t know if I should share this, but . . .”? If so, you’re a false witness because, although you might be telling the truth, you’re not telling the whole truth. You’re failing to factor in God’s estimation of them. If you’re prone to bearing false witness, consider the following remedies: Say less, for as Solomon so insightfully declared, “In the multitude of words there wanteth not sin: but he that refraineth his lips is wise” (Proverbs 10:19). Pray more. “Remove from me the way of lying,” David prayed (Psalm 119:29). Think again. Before you say anything about anyone else, THINK: T: Is what you are about to say the whole Truth? H: Is it Helpful? Will people be edified? I: Is it Inspirational? Will God be praised as a result? N: Is it Necessary? K: Is it Kind? The best way to keep from bearing false witness is to simply say less, pray more, and think again.",
    "author": "Jon Courson"
  }
]