[
  {
    "scraped_at": "2025-06-30T01:18:32.099471",
    "date": "June 29, 2025",
    "title": "Daily Devotional with Pastor Jon",
    "scripture": "Thou shalt not bear false witness against thy neighbour.",
    "scripture_reference": "Exodus 20:16",
    "content": "The biblical viewpoint of bearing false witness is not confined to the telling of bold-faced lies, but also includes being tricky with the truth. In the one account where the phrase “false witness” is used in Scripture, we see individuals falsely accusing Jesus of threatening to destroy the Temple when, in fact, He was speaking of His own death (Matthew 26:59–61). Because he is the Father of Lies, Satan is the ultimate false witness, accusing us day and night before God’s throne as he points out our failings, our shortcomings, and our sins (Revelation 12:10). Jesus, on the other hand, is the Faithful and True Witness (Revelation 3:14), our Advocate, our defense lawyer. Are you a true witness or a false witness? If the person sitting next to you is a believer, he or she is righteously robed, Heaven-bound, Spirit-filled, positionally pure. Speaking anything less of them is bearing false witness. Oh, you might give the right information, but in so doing, do you convey the wrong implication? You might say lots of nice things about them, but do you add a “but, . . .” a “however, . . .” an “I don’t know if I should share this, but . . .”? If so, you’re a false witness because, although you might be telling the truth, you’re not telling the whole truth. You’re failing to factor in God’s estimation of them. If you’re prone to bearing false witness, consider the following remedies: Say less, for as Solomon so insightfully declared, “In the multitude of words there wanteth not sin: but he that refraineth his lips is wise” (Proverbs 10:19). Pray more. “Remove from me the way of lying,” David prayed (Psalm 119:29). Think again. Before you say anything about anyone else, THINK: T: Is what you are about to say the whole Truth? H: Is it Helpful? Will people be edified? I: Is it Inspirational? Will God be praised as a result? N: Is it Necessary? K: Is it Kind? The best way to keep from bearing false witness is to simply say less, pray more, and think again.",
    "author": "Jon Courson"
  }
]