{
  "scraped_at": "2025-07-05T15:10:53.066522",
  "date": "July 5, 2025",
  "title": "Daily Devotional with Pastor Jon",
  "scripture": "And thou shalt make a mercy seat of pure gold: two cubits and a half shall be the length thereof, and a cubit and a half the breadth thereof. And thou shalt make two cherubims of gold, of beaten work shalt thou make them, in the two ends of the mercy seat. And make one cherub on the one end, and the other cherub on the other end: even of the mercy seat shall ye make the cherubims on the two ends thereof. And the cherubims shall stretch forth their wings on high, covering the mercy seat with their wings, and their faces shall look one to another; toward the mercy seat shall the faces of the cherubims be. And thou shalt put the mercy seat above upon the ark.",
  "scripture_reference": "Exodus 25:17–21",
  "content": "Most Christians try to meet God at the Ark by keeping the commandments, by going to this meeting, by doing those things, by not sinning, by living purely. God, however, says He’ll meet us not at the Ark, but at that which covers it - the mercy seat. How do we walk with the Lord practically? Not by anything we do, how long our devotions are, how many chapters of the Bible we’ve read, how many prayers we offer, but simply and solely by the unmerited, undeserved, unearned favor of God. This is where so many people miss it. Although they know they’re saved by grace, they think they’re sanctified through works. Big mistake. A true relationship with God is not about witnessing, ministry, or devotional life. It’s all about what He did in and through Christ. On that first Easter Sunday morning, had you looked into the empty tomb, you would have seen two angels sitting, one at the head and one at the foot of the blood-stained slab where the body of Jesus had lain (John 20:12). Leviticus 16:14 tells us that the mercy seat would be sprinkled with blood. Thus, the mercy seat paints a perfect picture of the only way we can have fellowship with God, that being through the finished work of the Son.",
  "author": "Jon Courson"
}