{
  "scraped_at": "2025-07-07T15:11:47.082636",
  "date": "July 6, 2025",
  "title": "Daily Devotional with Pastor Jon",
  "scripture": "And in the ark thou shalt put the Testimony that I shall give thee. And there I will meet with thee, and I will commune with thee from above the mercy seat, from between the two cherubims which are upon the ark of the Testimony, of all things which I will give thee in commandment unto the children of Israel.",
  "scripture_reference": "Exodus 25:21–22",
  "content": "It was at the mercy seat that God would meet with man. And we err greatly whenever we forget this . . . After capturing the Ark, the Philistines eventually put it in the temple of their god Dagon, only to find Dagon face down before it the following day. Setting Dagon aright, they returned the next day to find him toppled over once again, this time with his head and hands severed (1 Samuel 5). While it would seem obvious that they needed a more powerful god to protect them, they instead decided to protect their god by sending the Ark back to Israel. Seeing the Ark on its way back to their border, the people of God were understandably excited. But their excitement soon turned to terror when God smote 50,070 of their number when they looked inside the ark, perhaps for no other reason than to see if the commandments were still inside (1 Samuel 6). “I will meet you at the mercy seat,” God says. But sometimes we make a deadly mistake when we set aside mercy to get to the bottom of an issue, to lay down the law on someone. I have done this, and it always leads to death in relationships, in families, in friendships, and in ministry. “The letter of the law kills,” Paul would write, “but the Spirit gives life” (see 2 Corinthians 3:6). Once we set aside mercy, even temporarily, to get to the bottom of an issue, to find out who’s right and who’s wrong, to get to the letter of the law, the end result will always be death. Always. Friendships will die. Families will divide. Ministry will shut down. No good comes from removing the mercy seat. Therefore, be merciful. To whom? To the person you’re angry with. Be gracious. To whom? To the person you feel has wronged you. Whenever you feel far from God, a practical way you can be brought back into His presence is by remembering the mercy seat. That is, find people to whom you can show mercy. I have discovered over and over again in my own life that there are two uniquely practical ways I truly experience the presence of the Lord. The first is by praising Him. Psalm 22:3 declares that He inhabits the praises of His people. The second is by showing mercy to people, for it was at the mercy seat that God chose to dwell.",
  "author": "Jon Courson"
}